"""
中等难度
给定一个整数数组 nums，将数组中的元素向右轮转 k 个位置，其中 k 是非负数。

示例 1:

输入: nums = [1,2,3,4,5,6,7], k = 3
输出: [5,6,7,1,2,3,4]
解释:
向右轮转 1 步: [7,1,2,3,4,5,6]
向右轮转 2 步: [6,7,1,2,3,4,5]
向右轮转 3 步: [5,6,7,1,2,3,4]


示例 2:

输入：nums = [-1,-100,3,99], k = 2
输出：[3,99,-1,-100]
解释:
向右轮转 1 步: [99,-1,-100,3]
向右轮转 2 步: [3,99,-1,-100]
"""


def rotate(nums, k):
    step = k - (len(nums) * int(k / len(nums)))
    front = nums[-step:]
    nums[step:] = nums[0:-step]
    nums[0:step] = front


# nums = [-1, -100, 3, 99]
# nums = [1, 2, 3, 4, 5, 6, 7]
nums = [1, 2]
k = 5


rotate(nums, k)
print(nums)
